new Vue({
el: "#app",
data: {
    search: "",
    list: [
        "上路巩州遇虎熊",
        "五百年前一场疯",
        "腾宵又是孙悟空",
        "失马鹰愁涧飞白龙",
        "沙河阻断路难通",
        "福陵山中收天蓬",
        "岭上前行逆黄风",
        "七星不照波月洞",
        "千年白骨化阴风",
        "鱼篮网通天一尾红",
        "紫金葫芦二道童",
        "九尾老狐敢压龙",
        "白虹坠雪浪击石碎",
        "思归",
        "难归",
        "堕回",
        "轮回",
        "月满一江水",
        "前世莫追",
        "福泽聚宝象",
        "春风度不让洛阳",
        "玉面狐折兰香",
        "七绝崖上暗伏赤色大蟒",
        "过西梁女儿国",
        "鸳鸯罗帐",
        "与三道斗法相火云扬",
        "明枪易挡暗箭难防"
    ],
    listSearch: [
        "上路巩州遇虎熊",
        "五百年前一场疯",
        "腾宵又是孙悟空",
        "失马鹰愁涧飞白龙",
        "沙河阻断路难通",
        "福陵山中收天蓬",
        "岭上前行逆黄风",
        "七星不照波月洞",
        "千年白骨化阴风",
        "鱼篮网通天一尾红",
        "紫金葫芦二道童",
        "九尾老狐敢压龙",
        "白虹坠雪浪击石碎",
        "思归",
        "难归",
        "堕回",
        "轮回",
        "月满一江水",
        "前世莫追",
        "福泽聚宝象",
        "春风度不让洛阳",
        "玉面狐折兰香",
        "七绝崖上暗伏赤色大蟒",
        "过西梁女儿国",
        "鸳鸯罗帐",
        "与三道斗法相火云扬",
        "明枪易挡暗箭难防"
    ]
},
methods: {
    searchCont(){
        this.listSearch = this.list.filter((text) => {
            return text.match(this.search);
        })
    }
}
})
